app/controllers/v1/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["comment", "Mozart"], ["created_at", "2018-05-26 09:48:05.874754"], ["updated_at", "2018-05-26 09:48:05.874754"]]

    def update
        if @comment = @comment.update(comment_params)
---
UPDATE "comments" SET "comment" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["comment", "Lord"], ["updated_at", "2018-05-26 10:15:29.375217"], ["id", 2]]